configurations/emacs/README.org
#+title: My Emacs Configuration
#+property: header-args:emacs-lisp :tangle "init.el" :mkdirp yes

* Intro
This is my emacs configuration. It's a mess.
Here are the configuration i took from to build mine:
- /minimal-emacs.d/ configuration of jamescherti https://github.com/jamescherti/minimal-emacs.d
- the excellent [[https://protesilaos.com/emacs/dotemacs][config]] of Protesilaos Stavrou
- the very instructive [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][config]] of David Wilson
- the well made emacs-solo of LionyxML https://github.com/LionyxML/emacs-solo
 
* Setup
** Install emacs
Emacs can both be installed from a package manager or built from sources.
This is a quick snippet to configure the emacs sources for linux:

#+begin_src shell
  ./configure --prefix=/usr/local --with-x-toolkit=gtk3 --disable-gc-mark-trace --with-native-compilation=aot --without-gif --without-tiff --without-selinux --with-xinput2 --without-gpm --without-compress-install --without-xft --with-cairo --with-harfbuzz --with-tree-sitter=ifavailable --without-gsettings --without-gconf
#+end_src

** Tangle this org literate config
Evaluate this line before tangling the whole file to avoid being
asked if confirm every code block
#+begin_src emacs-lisp :tangle no
  (setq org-confirm-babel-evaluate nil)
#+end_src
** ways to swap CTRL and CAPS-LOCK
*** Windows

to activate run this script as a .reg file
#+begin_src
REGEDIT4

[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
"Scancode Map"=hex:00,00,00,00,00,00,00,00,03,00,00,00,1d,00,3a,00,3a,00,1d,00,00,00,00,00
#+end_src

and run that as a .reg file to deactivate it

#+begin_src 
REGEDIT4
[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
"Scancode Map"=-
#+end_src

*** Linux
On Linux, using the X Windows Server it just need to run or put it in the init
script.

#+begin_src shell
  setxkbmap -option ctrl:swapcaps
#+end_src

** Linux
*** start server at startup script
Copy this to *"~/.config/systemd/user/emacs.service"*
#+begin_src shell
  [Unit]
  Description=Emacs text editor
  Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/

  [Service]
  Type=forking
  ExecStart=/usr/bin/emacs --daemon
  ExecStop=/usr/bin/emacsclient --eval "(kill-emacs)"
  Environment=SSH_AUTH_SOCK=%t/keyring/ssh
  Restart=on-failure

  [Install]
  WantedBy=default.target
#+end_src
and the enable the service with
#+begin_src shell
  systemctl enable --user emacs
  systemctl start --user emacs
#+end_src

** Windows
*** start server at startup script
#+begin_src shell
  # Path to startup file
  $startup_file = "$([Environment]::GetFolderPath('Startup'))\StartEmacsServer.bat"

  # Introduce variable HOME:
  # 1. for simplicity
  # 2. runemacs.exe expects it to be
  #
  # %APPDATA% is chosen because runemacs.exe operates there
  #	https://www.gnu.org/software/emacs/manual/html_node/emacs/Find-Init.html#Find-Init
  #	https://www.gnu.org/software/emacs/manual/html_node/emacs/General-Variables.html#General-Variables
  New-Item $startup_file -type file
  Set-Content -Path $startup_file -Value "set HOME=%APPDATA%"

  # Clean previous server file info first
  Add-Content -Path $startup_file -Value "del /Q ""%HOME%/.emacs.d/server/*"""
  Add-Content -Path $startup_file -Value "runemacs.exe --daemon"
#+end_src

*** install from scoop
The best way i found to install emacs on windows is via *scoop* and create a
script on *$USERPATH/Roaming/Microsoft/Windows/Start Menu/Programs/Startup* that
starts the emacs server automatically at the startup.

#+begin_src shell
  Set-ExecutionPolicy RemoteSigned -Scope CurrentUser # Optional: Needed to run a remote script the first time
  irm get.scoop.sh | iex
  scoop update *
  scoop buckets add kiennq-scoop
  scoop install emacs-k
#+end_src

*** build from source
- install msys2
- run this script
#+begin_src shell
  git clone https://github.com/emacs-mirror/emacs emacs-master  
  cd emacs-master
  mingw64-bat
  pacman -S --needed \
         base-devel \
         autoconf \
         mingw-w64-x86_64-toolchain \
         mingw-w64-x86_64-xpm-nox \
         mingw-w64-x86_64-gmp \
         mingw-w64-x86_64-gnutls \
         mingw-w64-x86_64-libtiff \
         mingw-w64-x86_64-giflib \
         mingw-w64-x86_64-libpng \
         mingw-w64-x86_64-libjpeg-turbo \
         mingw-w64-x86_64-librsvg \
         mingw-w64-x86_64-libwebp \
         mingw-w64-x86_64-lcms2 \
         mingw-w64-x86_64-jansson \
         mingw-w64-x86_64-libxml2 \
         mingw-w64-x86_64-zlib \
         mingw-w64-x86_64-harfbuzz \
         mingw-w64-x86_64-libgccjit \
         mingw-w64-x86_64-sqlite3 \
         mingw-w64-x86_64-tree-sitter
  ./autogen.sh
  ./configure --with-native-compilation=yes --with-tree-sitter --without-dbus --with-json --with-wide-int
  make
  make install
#+end_src

*** find
Under windows when emacs looks for *find* command it found one, but the wrong
one. One solution is to use MSYS2's one. So go to the
<MSYS2 ROOT>/usr/bin/ and copy
msys-iconv-2.dll
msys-intl-8.dll
find.exe
to the emacs bin folder* COMMENT User defined stuff

* COMMENT Elaborated one
** Early init
*** Package management
Configure /package.el/, the builtin package manager, disable it at startup and
set up the packages archives and their priorities.

#+begin_src emacs-lisp :tangle "early-init.el" 
  ;; Ensure that some built-in (e.g., org-mode) are always up to date
  (setq package-install-upgrade-built-in t)

  (defvar lm-emacs-package-initialize-and-refresh t
    "Whether to automatically initialize and refresh packages.When set to
             non-nil, Emacs will automatically call `package-initialize'
             and `package-refresh-contents' to set up and update the
             package system.")

  (setq package-enable-at-startup nil)
  (setq package-quickstart nil)
  (setq use-package-always-ensure nil)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("melpa-stable" . "https://stable.melpa.org/packages/")
                           ("gnu" . "https://elpa.gnu.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ("elpa-devel" . "https://elpa.gnu.org/devel/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (customize-set-variable 'package-archive-priorities '(("elpa" . 100)
                                                        ("elpa-devel" . 101)
                                                        ("gnu"    . 99)
                                                        ("nongnu" . 80)
                                                        ("stable" . 70)
                                                        ("melpa"  . 0)))

#+end_src

*** Early init definitions
Those symbols are mandatory to be defined because are used by other blocks and
defining them in a separate block will allow to disable other blocks without
causing errors.

**** Debug
#+begin_src emacs-lisp :tangle "early-init.el"
  (defvar lm-emacs-debug nil 
    "Non-nil to enable debug.")
#+end_src

**** Ui features
#+begin_src emacs-lisp :tangle "early-init.el"
  (defvar lm-emacs-ui-features '(context-menu)
    "List of user interface features to disable in minimal Emacs setup.

      This variable holds a list Emacs UI features that can be enabled:
      - `context-menu`: Enables the context menu in graphical environments.
      - `tool-bar`: Enables the tool bar in graphical environments.
      - `menu-bar`: Enables the menu bar in graphical environments.
      - `dialogs`: Enables both file dialogs and dialog boxes.
      - `tooltips`: Enables tooltips.

      Each feature in the list corresponds to a specific UI component that can be
      turned on."
    )
#+end_src

**** Useqr files
Set some useful paths:
- the emacs config directory
- the custom themes directory
and add the /lm-lisp/ and /lm-modules/ directories to the load-path.

#+begin_src emacs-lisp :tangle "early-init.el"
  (defvar lm-emacs-user-directory user-emacs-directory
    "The default value of the `user-emacs-directory' variable.")

  (setq custom-theme-directory
        (expand-file-name "themes/" lm-emacs-user-directory))

  ;; Add the folder of my cust lisp files and modules to the load-path
  (mapc (lambda (string)
          (add-to-list 'load-path (concat lm-emacs-user-directory string)))
        '("lm-lisp" "lm-modules" "lm-languages"))

  (setq custom-file (expand-file-name "custom.el" lm-emacs-user-directory))
#+end_src

**** Helper functions
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; This function load a file if exists
  (defun lm-emacs-load-user-init (filename)
    "Execute a file of Lisp code named FILENAME."
    (let ((user-init-file
           (expand-file-name filename
                             lm-emacs-user-directory)))
      (when (file-exists-p user-init-file)
        (load user-init-file nil t))))

  (defun lm-add-to-list (list element)
    "Add to symbol of LIST the given ELEMENT.
  Simplified version of `add-to-list'."
    (set list (cons element (symbol-value list))))
#+end_src
*** Windows frame
The initial-frame-alist is about the first frame that is produced when starting
Emacs. The default-frame-alist is for all frames after that.

#+begin_src emacs-lisp :tangle "early-init.el"
  (mapc
   (lambda (var)
     (lm-add-to-list var '(width . (text-pixels . 800)))
     (lm-add-to-list var '(height . (text-pixels . 900)))
     (lm-add-to-list var '(scroll-bar-width  . 10)))
   '(default-frame-alist initial-frame-alist))
#+end_src

*** Ui features
Enable or disable some UI features:
- menu-bar-mode
- tool-bar-mode
- context-menu
- dialogs
- tooltips
- frame title
- emacs welcome page

#+begin_src emacs-lisp :tangle "early-init.el"
  (defvar lm-emacs-frame-title-format "%b – Emacs"
    "Template for displaying the title bar of visible and iconified frame.")
  (setq frame-title-format lm-emacs-frame-title-format
        icon-title-format lm-emacs-frame-title-format)

  ;; Disable startup screens and messages
  (setq inhibit-splash-screen t)

  ;; I intentionally avoid calling `menu-bar-mode', `tool-bar-mode', and
  ;; `scroll-bar-mode' because manipulating frame parameters can trigger or queue
  ;; a superfluous and potentially expensive frame redraw at startup, depending
  ;; on the window system. The variables must also be set to `nil' so users don't
  ;; have to call the functions twice to re-enable them.
  (unless (memq 'menu-bar lm-emacs-ui-features)
    (push '(menu-bar-lines . 0) default-frame-alist)
    (unless (memq window-system '(mac ns))
      (setq menu-bar-mode nil)))


  (if (display-graphic-p) (unless (daemonp)
                            (unless noninteractive
                              ;; Temporarily override the tool-bar-setup function to prevent it from
                              ;; running during the initial stages of startup
                              (advice-add #'tool-bar-setup :override #'ignore)
                              (define-advice startup--load-user-init-file
                                  (:before (&rest _) lm-emacs-setup-toolbar)
                                (advice-remove #'tool-bar-setup #'ignore)
                                (tool-bar-setup)))))

  (unless (memq 'tool-bar lm-emacs-ui-features)
    (push '(tool-bar-lines . 0) default-frame-alist)
    (setq tool-bar-mode nil))

  (push '(vertical-scroll-bars) default-frame-alist)
  (push '(horizontal-scroll-bars) default-frame-alist)
  (setq scroll-bar-mode nil)
  (when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

  (unless (memq 'tooltips lm-emacs-ui-features)
    (when (bound-and-true-p tooltip-mode)
      (tooltip-mode -1)))

  ;; Disable GUIs because they are inconsistent across systems, desktop
  ;; environments, and themes, and they don't match the look of Emacs.
  (unless (memq 'dialogs lm-emacs-ui-features)
    (setq use-file-dialog nil)
    (setq use-dialog-box nil))

  (defalias #'view-hello-file #'ignore)  ; Never show the hello file

#+end_src

