configurations/emacs/README.org
**** lsp-mode
#+begin_src emacs-lisp :tangle "lm-modules/lm-lsp-mode.el"
  (if (eq lm-lsp-client 'lsp-mode)
      (progn
        (defun lm/lsp-mode-setup ()
          (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
          (lsp-headerline-breadcrumb-mode))

        (setenv "LSP_USE_PLISTS" "true")
        (setq lsp-use-plists t)
        (use-package lsp-mode
          :ensure t
          :config
          (lsp-enable-which-key-integration t)
          (setq lsp-idle-delay 0.100)
          (setq lsp-auto-execute-action nil)

          ;; ----------------------------- LSP KEYMAPS -------------------------------
          (if (eq lm-input-mode 'evil)
              (progn
                (defvar lm/leader-map-lsp (make-sparse-keymap)
                  "sub-keymap for lsp operations")
                (keymap-set lm/leader-map "l" `("+lsp" . ,lm/leader-map-lsp))
                (keymap-set lm/leader-map-lsp "f" 'lsp-format-buffer)
                (defvar lm/leader-map-lsp-go-to (make-sparse-keymap)
                  "sub-keymap for lsp go to operations")
                (keymap-set lm/leader-map-lsp "g" `("+Go to" . ,lm/leader-map-lsp-go-to))
                (keymap-set lm/leader-map-lsp-go-to "d" 'lsp-find-definition)
                (keymap-set lm/leader-map-lsp-go-to "D" 'lsp-find-declaration)
                (keymap-set lm/leader-map-lsp-go-to "i" 'lsp-find-implementation)
                (keymap-set lm/leader-map-lsp-go-to "r" 'lsp-find-references)
                (defvar lm/leader-map-lsp-diagnostics (make-sparse-keymap)
                  "sub-keymap for lsp diagnostics operations")
                (keymap-set lm/leader-map-lsp "d" `("+Diagnostics" . ,lm/leader-map-lsp-diagnostics))
                (keymap-set lm/leader-map-lsp-diagnostics "l" 'flymake-show-project-diagnostics)
                (keymap-set lm/leader-map-lsp-diagnostics "n" 'flymake-goto-next-error)
                (keymap-set lm/leader-map-lsp-diagnostics "p" 'flymake-goto-prev-error)))

          ;; -------------------------- LSP REMOTE CONNECTIONS -----------------------
                                          ; (lsp-register-client
                                          ;  (make-lsp-client :new-connection (lsp-tramp-connection "clangd")
                                          ;                   :major-modes '(c-mode c++-mode)
                                          ;                   :remote? t
                                          ;                   :server-id 'clangd-remote))
          )

        (use-package lsp-ui
          :ensure t
          :after lsp-mode
          :hook (lsp-mode . lsp-ui-mode)
          :custom
          (lsp-ui-doc-position 'bottom))))

  (provide 'lm-lsp-mode)
#+end_src
**** eglot
#+begin_src emacs-lisp :tangle "lm-modules/lm-eglot.el"
  (defun lm-eglot-mode-keymaps ()
    (cond ((eq lm-input-mode 'evil)
           (progn
             (keymap-set evil-normal-state-map "C-w C-d" #'flymake-show-buffer-diagnostics)
             ))))

  (use-package eglot
    :ensure t
    :defer t
    :pin elpa-devel
    :config
    (add-hook eglot-managed-mode-hook #'lm-eglot-mode-keymaps)
    :init
    (setq eglot-events-buffer-config 0)
    (setq eglot-connect-timeout 90))


  (provide 'lm-eglot)
#+end_src
*** ultra-scroll
#+begin_src emacs-lisp :tangle "lm-modules/lm-ultra-scroll.el"
  (use-package ultra-scroll
    :vc (:url "https://github.com/jdtsmith/ultra-scroll"
         :rev :newest)
    :init
    (setq scroll-conservatively 101
          scroll-margin 0)
    :config
    (ultra-scroll-mode))
  (provide 'lm-ultra-scroll)
#+end_src

*** completion
#+begin_src emacs-lisp :tangle "lm-modules/lm-completion.el"
  (cond
   ((eq lm-in-buffer-completion 'company)
    (require 'lm-company))

   ((eq lm-in-buffer-completion 'corfu)
    (require 'lm-corfu))

   ((eq lm-in-buffer-completion 'builtin)
    (require 'lm-builtin-completion)
    ))

  (provide 'lm-completion)
#+end_src

**** cape
#+begin_src emacs-lisp :tangle "lm-modules/lm-cape.el"
  (use-package cape
    :ensure t
    :defer nil
    :init
    (setq completion-ignore-case t)
    (add-to-list 'completion-at-point-functions 'cape-dabbrev)
    (add-to-list 'completion-at-point-functions 'cape-keyword)
    (add-to-list 'completion-at-point-functions 'cape-file)) 

  (provide 'lm-cape)
#+end_src
**** company
#+begin_src emacs-lisp :tangle "lm-modules/lm-company.el"
    (if (eq lm-in-buffer-completion 'company)
        (use-package company
          :ensure t
          :diminish
          :defer 1
          :init
          (setq lm-action-complete-ptr #'company-complete)
          (setq company-dabbrev-ignore-case t)
          (setq company-dabbrev-code-ignore-case t)    
          (setq company-keywords-ignore-case t)
          (setq company-minimum-prefix-length 3)
          (setq company-idle-delay 0.3)
          :config
          ;; (add-to-list 'company-backends '(company-capf :with company-dabbrev))
          (defun lm/company-format-margin (candidate selected)
            "Format the margin with the backend name."
            (let ((backend (company-call-backend 'annotation candidate)))
              (if backend
                  (format " [%s]" backend)
                "")))
          (setq company-format-margin-function 'lm/company-format-margin)
          (global-company-mode t)))

    (provide 'lm-company)
#+end_src
**** corfu
#+begin_src emacs-lisp :tangle "lm-modules/lm-corfu.el"
  (use-package corfu
    :ensure t
    :init
    (global-corfu-mode)
    :custom
    (corfu-auto t)
    (corfu-cycle t)
    (corfu-auto-delay 0.3)
    (corfu-preview-current 'insert)
    (corfu-quit-no-match 'separator)
    (corfu-preselect 'prompt)
    (corfu-on-exact-match 'insert)
    (text-mode-ispell-word-completion nil)
    )

  (unless (display-graphic-p)
    (use-package corfu-terminal
      :init
      (custom-set-faces
       '(corfu-default ((t (:background "black")))))
      :config
      (corfu-terminal-mode)))

  (provide 'lm-corfu)
#+end_src
**** only built-in
#+begin_src emacs-lisp :tangle "lm-modules/lm-builtin-completion.el"
    ;; TODO hints dabbrev-complete (f), completion-at-point-functions (v)
    ;; check the customize page for capf

    (when (>= emacs-major-version 30)
      (use-package completion-preview
        :config
        (global-completion-preview-mode)))

    (setq completions-format 'horizontal) ;; alternatives are `horizontal', `vertical' and `one-column'
    (setq lm-action-complete-ptr #'completion-at-point)
    (setq completions-header-format nil)
    (setq completions-max-height 20)
    (setq completion-auto-select nil)
    (define-key minibuffer-mode-map (kbd "C-n") 'minibuffer-next-completion)
    (define-key minibuffer-mode-map (kbd "C-p") 'minibuffer-previous-completion)

    (defun my/minibuffer-choose-completion (&optional no-exit no-quit)
      (interactive "P")
      (with-minibuffer-completions-window
        (let ((completion-use-base-affixes nil))
          (choose-completion nil no-exit no-quit))))

    (setq lm-action-complete-ptr #'completion-at-point)
    (define-key completion-in-region-mode-map (kbd "M-RET") 'my/minibuffer-choose-completion)

    (provide 'lm-builtin-completion)
#+end_src

*** Snippets
**** yasnippet
#+begin_src emacs-lisp :tangle "lm-modules/lm-yasnippet.el"
  (use-package yasnippet
    :ensure t
    :defer 2
    :config
    (yas-minor-mode)
    (cond
     ((eq lm-in-buffer-completion 'company)
      (progn
        ;; (add-to-list 'company-backends 'company-yasnippet)
        (global-set-key (kbd "C-c y") 'company-yasnippet)
        ))))

  (use-package yasnippet-snippets
    :after yasnippet)
#+end_src

*** olivetti
This is a nice package for zen mode editing
#+begin_src emacs-lisp :tangle "lm-modules/lm-olivetti.el"
  (use-package olivetti
    :ensure t
    :defer 1
    :init
    (lm/leader-keys
     :keymaps 'override
     :states 'normal
     "ao" '(olivetti-mode :which-key "olivetti mode"))
    :config
    (add-hook 'olivetti-mode-hook (lambda ()
                                    (display-line-numbers-mode 0)
                                    (display-fill-column-indicator-mode 0))))
#+end_src

** Source post-init.el
The /post-init.el/ is file is where should be located the machine
dependent customization done after the main initialization has been
done. This file is not updated in the git repository.

#+begin_src emacs-lisp
  (lm-emacs-load-user-init "post-init.el")
#+end_src

** Programming languages
**** C/C++
***** Windows clangd with MSys2/Mingw-w64
On Windows, when using MSys2-Mingw-64 to compile and clangd as LSP a per project
configuration file named /.clangd/ or a global one named
/~\AppData\Local\clangd\config.yaml/ is required. 
The content of the file must be

#+begin_src dot
  CompileFlags:
  Add: [-target, x86_64-pc-windows-gnu]
#+end_src
***** cmake
#+begin_src emacs-lisp :tangle "lm-languages/cmake.el"
  (use-package cmake-mode
    :ensure t
    :mode ("\\CMakeLists.txt" . cmake-mode))
  (provide 'lm-cmake)
#+end_src

**** Arduino
#+begin_src emacs-lisp :tangle "lm-languages/lm-arduino.el"
  (add-to-list 'auto-mode-alist '("\\.ino\\'" .
                                  (lambda ()
                                    (c-or-c++-mode)
                                    (setq lsp-clients-clangd-args
                                          `(
                                            "-j=2"
                                            "--background-index"
                                            "--clang-tidy"
                                            "--completion-style=detailed"
                                            (concat "--query-driver=" (getenv-internal "HOME") "/.platformio/packages/toolchain-atmelavr/bin/avr-g++"))))))
  (provide 'lm-arduino)
#+end_src
**** Rust
This will activate the rust treesitter mode for rust files. However it could be necessary to install the treesitter library for rust.
With emacs 29+ it can be done with *M-x treesit-install-language-grammar rust* that will download and compile the needed library.
#+begin_src emacs-lisp :tangle "lm-languages/lm-rust.el"
  (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))
  (provide 'lm-rust)
#+end_src
**** Powershell
#+begin_src emacs-lisp :tangle "lm-languages/lm-powershell.el"
  (use-package powershell    
    :ensure t
    :defer t
    :init
    (setq compile-command "pwsh -c ./project.ps1 ")
    :commands powershell)

  (use-package ob-powershell
    :ensure t
    :after org)
#+end_src

**** MATLAB
#+begin_src emacs-lisp :tangle "lm-languages/lm-matlab.el"
  (use-package matlab-mode
    :ensure t
    :defer t
    :mode ("\\.m\\'" . matlab-mode))
#+end_src

**** wgsl 
#+begin_src emacs-lisp :tangle "lm-languages/lm-matlab.el"
  (use-package wgsl-mode
    :ensure t
    :defer t
    :mode ("\\.wgsl\\'" . wgsl-mode))
#+end_src

* Simple one
** Early init
*** start of the file
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; -*- lexical-binding: t -*-
#+end_src
*** garbage collector
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
#+end_src
*** avoid startup flash
#+begin_src emacs-lisp :tangle "early-init.el"
  (defun emacs-solo/avoid-initial-flash-of-light ()
    "Avoid flash of light when starting Emacs."
    (setq mode-line-format nil))
  (emacs-solo/avoid-initial-flash-of-light)
#+end_src
*** better Window Management handling
Resizing the Emacs frame can be a terribly expensive part of changing the font.
By inhibiting this, we easily halve startup times with fonts that are larger
than the system default.
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("Emacs"))

  (setq inhibit-compacting-font-caches t)
#+end_src
*** disables unused UI Elements
#+begin_src emacs-lisp :tangle "early-init.el"
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
#+end_src
*** add custom directories to load-path
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Add the folder of my cust lisp files and modules to the load-path
  (mapc (lambda (string)
          (add-to-list 'load-path (concat user-emacs-directory string)))
        '("lm-lisp" "lm-modules" "lm-languages"))
#+end_src
*** provide early-init
#+begin_src emacs-lisp :tangle "early-init.el"
  (provide 'early-init) 
#+end_src
** Init
*** start of the file
#+begin_src emacs-lisp :tangle "init.el"
  ;; -*- lexical-binding: t -*-
#+end_src

