configurations/emacs/README.org
*** eglot configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package eglot
    :custom
    (eglot-autoshutdown t)
    (eglot-events-buffer-size 0)
    (eglot-events-buffer-config '(:size 0 :format full))
    (eglot-prefer-plaintext t)
    (jsonrpc-event-hook nil)
    (eglot-code-action-indications nil)
    :init
    (fset #'jsonrpc--log-event #'ignore)

    :bind (:map
  		 eglot-mode-map
  		 ("C-c l a" . eglot-code-actions)
  		 ("C-c l o" . eglot-code-actions-organize-imports)
  		 ("C-c l r" . eglot-rename)
  		 ("C-c l f" . eglot-format)))
#+end_src
*** minibuffer configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package minibuffer
    :custom
    ;; (completion-auto-select t) ;; only turn this on if not using icomplete
    (enable-recursive-minibuffers t)
    (read-file-name-completion-ignore-case t)
    (read-buffer-completion-ignore-case t)
    :config
    ;; Keep the cursor out of the read-only portions of the minibuffer
    (setq minibuffer-prompt-properties
  		'(read-only t intangible t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Keep minibuffer lines unwrapped, long lines like on M-y will be truncated
    (add-hook 'minibuffer-setup-hook
  			(lambda () (setq truncate-lines t)))

    (minibuffer-depth-indicate-mode 1)
    (minibuffer-electric-default-mode 1))
#+end_src
*** electric configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package electric-pair
    :defer
    :hook (after-init . electric-pair-mode))
#+end_src
*** whitespace configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package whitespace
    :init
    (setq whitespace-style '(face trailing tabs spaces indentation emtpy))
    :config
    (add-hook 'whitespace-mode-hook
    		  (lambda ()
    			(set-face-attribute 'whitespace-indentation nil :foreground 'unspecified :background 'unspecified)
    			(set-face-attribute 'whitespace-line nil :foreground 'unspecified :background 'unspecified)
    			(set-face-attribute 'whitespace-space nil :foreground 'unspecified :background 'unspecified))))
#+end_src
*** compilation configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package compilation-mode
    :defer t
    :init (setq compilation-always-kill t
  			  compilation-scroll-output 'first-error ))
#+end_src
*** org configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package org
    :defer t
    :mode ("\\.org\\'" . org-mode)
    :hook (org-mode . (lambda ()
  					  (set-fill-column 130)
  					  (visual-line-mode 1)))
    :config
    (setq
     ;; Start collapsed for speed
     org-startup-folded t
     org-startup-indented t

     ;; Edit settings
     org-auto-align-tags nil
     org-tags-column 0
     org-catch-invisible-edits 'show-and-error
     org-special-ctrl-a/e t
     org-insert-heading-respect-content t
     org-use-sub-superscripts "{}"
     org-log-done t

     ;; Org styling, hide markup etc.
     org-startup-with-inline-images t
     org-hide-emphasis-markers t
     org-image-actual-width '(450)
     org-pretty-entities t
   ))
#+end_src
*** treesitter languages configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package rust-ts-mode
    :ensure rust-ts-mode
    :mode "\\.rs\\'"
    :defer t
    :custom
    (rust-indent-level 2)
    :config
    (add-to-list 'treesit-language-source-alist '(rust "https://github.com/tree-sitter/tree-sitter-rust" "master" "src")))
#+end_src
*** provide init
#+begin_src emacs-lisp :tangle "init.el"
  (provide 'init)
#+end_src
* My packages
** lm-utils
#+begin_src emacs-lisp :tangle "lm-lisp/lm-utils.el"
  ;; -*- lexical-binding: t -*-
  ;; TODO change the name of this function or get rid of it because it
  ;; just gives the name of the directory of the current buffer.
  (defun lm-get-dotfiles-dir ()
    (interactive)
    (file-name-directory (directory-file-name
  						(file-name-directory (directory-file-name
  											  (file-truename
  											   user-emacs-directory))))))

  (lm-get-dotfiles-dir)

  (defun lm-open-literate-config ()
    (interactive)
    (find-file (concat user-emacs-directory "README.org")))

  (defun lm-open-post-init ()
    (interactive)
    (find-file (concat user-emacs-directory "post-init.el")))

  (provide 'lm-utils)
#+end_src
** lm-mode-line
I'm trying to create a more essential and polished modeline
#+begin_src emacs-lisp :tangle "lm-lisp/lm-modeline.el"
  ;; -*- lexical-binding: t -*-
  (provide lm-mode-line)
#+end_src
** lm-pomodoro
#+begin_src emacs-lisp :tangle "lm-lisp/lm-pomodoro.el"
  ;; -*- lexical-binding: t -*-
  (defun lm-pomodoro ()
    (interactive)
    (require 'org-element)
    (setq org-clock-sound (concat (lm-get-dotfiles-dir) "share/sounds/bell.wav"))
    (unless (boundp 'lm/pomodoro-state)
      (setq lm/pomodoro-state 0))
    (let ((time-work "00:25:00")
          (time-pause "00:05:00"))
      (org-timer-set-timer
       (cond
        ((= (mod lm/pomodoro-state 2) 0) time-work)
        ((= (mod lm/pomodoro-state 3) 0) time-work)
        (t time-pause)))
      (setq lm/pomodoro-state (+ lm/pomodoro-state 1))))

  (provide 'lm-pomodoro)
#+end_src						

** lm-center-mode
This module is heavily inspired from David Wilson center-document-mode. Look at it
in his literate configuration file.
#+begin_src emacs-lisp :tangle "lm-modules/lm-center-document.el"
  ;; -*- lexical-binding: t -*-
  (defcustom lm-center-document-desired-width 90
    "Width of the centered line in lm-centered-mode"
    :type '(integer)
    :group 'lm)

  (defun lm-center-document--adjust-margins ()
    ;; Reset margins first before recalculating
    (set-window-parameter nil 'min-margins nil)
    (set-window-margins nil nil)

    ;; Adjust margins if the mode is on
    (when lm-center-document-mode
      (let ((margin-width (max 0
                               (truncate
                                (/ (- (window-width)
                                      lm-center-document-desired-width)
                                   2.0)))))
        (when (> margin-width 0)
          (set-window-parameter nil 'min-margins '(0 . 0))
          (set-window-margins nil margin-width margin-width)))))

  (define-minor-mode lm-center-document-mode
    "Toggle centered text layout in the current buffer."
    :lighter " Centered"
    :group 'editing
    (if lm-center-document-mode
        (add-hook 'window-configuration-change-hook #'lm-center-document--adjust-margins 'append 'local)
      (remove-hook 'window-configuration-change-hook #'lm-center-document--adjust-margins 'local))
    (lm-center-document--adjust-margins))

  (provide 'lm-center-document)

#+end_src
** lm-hold-directory
Sometimes i prefer that opening a new buffer does not change the current
working directory to the buffer file path. So this function lock the
current working directory and reset it to the held value after a file is
opened. If called again it release the current working directory to
the normal behaviour.

#+begin_src emacs-lisp :tangle "lm-modules/lm-hold-directory.el"
  ;; -*- lexical-binding: t -*-
  (defvar lm-held-directory nil
    "The directory being held has default-directory. If nil no directory is being
  hold. This variable is used by the `lm-toggle-hold-cwd' function.")

  (defun lm-toggle-hold-cwd ()
    (interactive)
    (setq lm-held-directory (unless lm-held-directory default-directory))
    (dolist (hook
             '(find-file-hook
               window-buffer-change-functions
               dired-mode-hook
               ))
      (add-hook hook #'(lambda () (if lm-held-directory (cd lm-held-directory))))))

  (provide 'lm-hold-directory)
#+end_src
** lm-enhanced-eshell
#+begin_src emacs-lisp :tangle "lm-modules/lm-enhanced-eshell.el"
  ;; -*- lexical-binding: t -*-  
  (require 'eshell)

  (setq lm-current-eshell-counter 0)

  (defun lm-make-eshell (name)
    "Create a new eshell buffer named NAME."
    (interactive "sName: ")
    (setq name (concat "$" name))
    (eshell)
    (rename-buffer name))

  (defun lm-tree-dir (dir &optional prefix)
    "Return a string with the tree of files and directories starting from DIR."
    (interactive "DDirectory: ")
    (unless prefix (setq prefix ""))
    (let ((content ""))
  	(dolist (file (directory-files dir))
  	  (unless (member file '("." ".."))
  		(let ((path (concat dir "/" file)))
  		  (setq content (concat content prefix (if (file-directory-p path) "+ " "- ") file "\n"))
  		  (when (file-directory-p path)
  			(setq content (concat content prefix (lm-tree-dir path (concat prefix "  "))))))))
  	content))

  (defun lm-tree-current-dir ()
    "Return a string with the tree of the current directory."
    (interactive)
    (lm-tree-dir default-directory))

  (defun eshell/tree ()
    "Print a tree of the current directory."
    (eshell-print (lm-tree-dir default-directory)))

  (defun eshell/lm-cat-with-syntax-highlighting (filename)
    "Like cat(1) but with syntax highlighting.
  Stole from aweshell"
    (let ((existing-buffer (get-file-buffer filename))
          (buffer (find-file-noselect filename)))
      (eshell-print
       (with-current-buffer buffer
  	   (if (fboundp 'font-lock-ensure)
  		   (font-lock-ensure)
           (with-no-warnings
  		   (font-lock-fontify-buffer)))
  	   (let ((contents (buffer-string)))
           (remove-text-properties 0 (length contents) '(read-only nil) contents)
           contents)))
      (unless existing-buffer
  	  (kill-buffer buffer))
      nil))

  (advice-add 'eshell/cat :override #'eshell/lm-cat-with-syntax-highlighting)

  (provide 'lm-enhanced-eshell)
#+end_src
** lm-dired-side
Inspired by emacs-solo of LionxyML

#+begin_src emacs-lisp :tangle "lm-modules/lm-dired-side.el"
  ;; -*- lexical-binding: t -*-
  ;; TODO add-hook dired-hide-details-mode to dired-mode-hook when the
  ;; name of the buffer is *Dired-Side*

  ;; TODO create a variable to configure the size of the dired side
  ;; window and the position

  (defun lm-dired-side-vc-root (&optional directory-path)
    "Create a *Dired-Side* like an IDE file explorer"
    (interactive)
    (let ((dir (if directory-path (dired-noselect directory-path)
  			   (if (eq (vc-root-dir) nil)
  				   (dired-noselect default-directory)
  				 (dired-noselect (vc-root-dir))))))
  	(display-buffer-in-side-window dir `(
  										 (side . left)
  										 (slot . 0)
  										 (window-width . 30)
  										 (window-parameters . ((no-other-window . t)
  															   (no-delete-other-windows . t)
  															   (mode-line-format . (" " "%b"))))))
  	(with-current-buffer dir (let ((window (get-buffer-window dir)))
  							   (when window (select-window window)
  									 (rename-buffer "*Dired-Side*"))))))

  (provide 'lm-dired-side)
#+end_src
** lm-terminal-here
#+begin_src emacs-lisp :tangle "lm-modules/lm-terminal-here.el"
  ;; -*- lexical-binding: t -*-
  (defcustom lm-terminal-here-cmd '("")
    "The command that shall be used to launch a new terminal window.
            If there is the need to place the `default-directory' content in the
            command put the placeholder '%cwd%' in this command string as it
            will be replaced with the default directory.

    Example for MS-Windows:
    \"cmd.exe /C start cmd.exe\"

    Example for KDE:
    \"konsole\"
    "
    :type 'string
    :group 'lm-terminal-here)

  (defun lm-terminal-here ()
    (interactive)
    (let* ((proc-args
  		  (mapcar
  		   (lambda (arg) (if (string= "%cwd%" arg) default-directory arg))
  		   lm-terminal-here-cmd))
  		 (proc (apply 'start-process "terminal-here" nil proc-args)))
  	(set-process-query-on-exit-flag proc nil)))

  (provide 'lm-terminal-here)
#+end_src
* My themes
