configurations/emacs/init.el
  (eglot-autoshutdown t)
  (eglot-events-buffer-size 0)
  (eglot-events-buffer-config '(:size 0 :format full))
  (eglot-prefer-plaintext t)
  (jsonrpc-event-hook nil)
  (eglot-code-action-indications nil)
  :init
  (fset #'jsonrpc--log-event #'ignore)

  :bind (:map
		 eglot-mode-map
		 ("C-c l a" . eglot-code-actions)
		 ("C-c l o" . eglot-code-actions-organize-imports)
		 ("C-c l r" . eglot-rename)
		 ("C-c l f" . eglot-format)))

(use-package minibuffer
  :custom
  ;; (completion-auto-select t) ;; only turn this on if not using icomplete
  (enable-recursive-minibuffers t)
  (read-file-name-completion-ignore-case t)
  (read-buffer-completion-ignore-case t)
  :config
  ;; Keep the cursor out of the read-only portions of the minibuffer
  (setq minibuffer-prompt-properties
		'(read-only t intangible t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Keep minibuffer lines unwrapped, long lines like on M-y will be truncated
  (add-hook 'minibuffer-setup-hook
			(lambda () (setq truncate-lines t)))

  (minibuffer-depth-indicate-mode 1)
  (minibuffer-electric-default-mode 1))

(use-package electric-pair
  :defer
  :hook (after-init . electric-pair-mode))

(use-package whitespace
  :init
  (setq whitespace-style '(face trailing tabs spaces indentation emtpy))
  :config
  (add-hook 'whitespace-mode-hook
  		  (lambda ()
  			(set-face-attribute 'whitespace-indentation nil :foreground 'unspecified :background 'unspecified)
  			(set-face-attribute 'whitespace-line nil :foreground 'unspecified :background 'unspecified)
  			(set-face-attribute 'whitespace-space nil :foreground 'unspecified :background 'unspecified))))

(use-package compilation-mode
  :defer t
  :init (setq compilation-always-kill t
			  compilation-scroll-output 'first-error ))

(use-package org
  :defer t
  :mode ("\\.org\\'" . org-mode)
  :hook (org-mode . (lambda ()
					  (set-fill-column 130)
					  (visual-line-mode 1)))
  :config
  (setq
   ;; Start collapsed for speed
   org-startup-folded t
   org-startup-indented t

   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t
   org-use-sub-superscripts "{}"
   org-log-done t

   ;; Org styling, hide markup etc.
   org-startup-with-inline-images t
   org-hide-emphasis-markers t
   org-image-actual-width '(450)
   org-pretty-entities t
 ))

(use-package rust-ts-mode
  :ensure rust-ts-mode
  :mode "\\.rs\\'"
  :defer t
  :custom
  (rust-indent-level 2)
  :config
  (add-to-list 'treesit-language-source-alist '(rust "https://github.com/tree-sitter/tree-sitter-rust" "master" "src")))

(provide 'init)
